app/controllers/todo_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 1]]
---
    def show
        @t=Todo.find(params[:id])

INSERT INTO "todos" ("description", "pomodoro_estimate", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Lunch"], ["pomodoro_estimate", 2], ["completed", "f"], ["created_at", "2018-08-19 18:25:45.748459"], ["updated_at", "2018-08-19 18:25:45.748459"]]
---
    def create
        t=Todo.new
        t.description=params[:description]
        t.pomodoro_estimate=params[:pomodoro_estimate]
        t.completed=false
        t.save

DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 10]]
---
    def destroy
        Todo.destroy(params[:id])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 2]]
---
    def edit
        @t=Todo.find(params[:id])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "todos" SET "description" = $1, "pomodoro_estimate" = $2, "completed" = $3, "updated_at" = $4 WHERE "todos"."id" = $5  [["description", nil], ["pomodoro_estimate", nil], ["completed", "f"], ["updated_at", "2018-08-19 21:35:31.926560"], ["id", 2]]
---
    def update
        t=Todo.find(params[:id])
        t.description=params[:description]
        t.pomodoro_estimate=params[:pomodoro_estimate]
        t.completed=false
        t.save